## How to get the first N rows in Pandas DataFrame

In [2]:
import pandas as pd
pd.__version__

'1.1.3'

In [6]:
# We are goingo to work with a simple DataFrame
# This statistic shows the average prices in dollars for home electronics and household appliances
# in selected cities around the world in 2018. 

Prices = {'Cities': ['Budapest','Brussels','Zagred','Buenos Aires','Oslo','Lisbon','Seoul'],
          'Price':[5554,5530,5489,5482,5362,5351,5219]}

df = pd.DataFrame(Prices)

In [7]:
df

         Cities  Price
0      Budapest   5554
1      Brussels   5530
2        Zagred   5489
3  Buenos Aires   5482
4          Oslo   5362
5        Lisbon   5351
6         Seoul   5219

In [8]:
# If we want the first 3 rows, we can use
df.head(3)

     Cities  Price
0  Budapest   5554
1  Brussels   5530
2    Zagred   5489

In [9]:
# we can save it in a vaiable
a= df.head(3)

In [11]:
a

     Cities  Price
0  Budapest   5554
1  Brussels   5530
2    Zagred   5489